import akshare as ak
import requests
import warnings

warnings.filterwarnings("ignore")

'''
新浪接口被禁止
'''
base_url = " http://hq.sinajs.cn/list="
def get_info(codelist):
    print("codelist ==>",codelist)



    # 使用逗号作为分隔符将列表转换为字符串
    # codes = ', '.join(str(item) for item in codelist)
    # codelist
    # url = base_url + codelist
    # print(url)
    #
    # response = requests.post(url)
    #
    # print(response)

    '''
    没有指定接口的数据让拿到
    '''
    #使用ak_share
    # ak.stock_zh_a_spot_em

    '''
    全量 - 匹配适合自己的？
    '''
    # 将字符串转换为列表，如果codelist最初是字符串形式的话
    # codelist = codelist.split(',')

    aa = ak.stock_zh_a_spot_em()
    aa.to_csv("./aaa.csv")
    need_col = ['代码', '名称', '涨跌幅', '量比', '5分钟涨跌', '涨速']
    df = aa[need_col]
    # df = df[(df['涨跌幅'] > 9) & (df['涨跌幅'] < 11)]
    # print(df)

    # 重命名
    # df.rename(columns={'代码': 'code', '名称': 'name', '涨跌幅': 'changepercent'}, inplace=True)
    df = df[(df['代码'].isin(codelist))]

    return df

# get_info("600706,001324")


list_zixuangu = [
'300467',	
'002425',	
'003009',	
'002835',	
'002385',	
'000679',	
'002670',	
'601099',	
'600155',	
'000981',	
'003007',	
'002865',	
'002229',	
'002428',	
'002049',	
'601136',	
'002156',	
'603186',	
'002657',	
'603985',	
'600895',	
'002253',	
'603779',	
'002848',	
'000948',	
'002456',	
'002623',	
'002845',	
'603912',	
'600127',	
'300255',	
'601127',	
'603000',	
'001309',	
'000536'	

]


list_ruozhuanqiang = [
'002786',	
'000679',	
'600733',	
'603388',	
'603163',	
'600615',	
'000010',	
'002380',	
'003026',	
'300290',	
'300342',	
'600155',	
'600892',	
'603005',	
'603353',	
'603773',	
'603788',	
'600525',	
'600410',	
'601127',	
'605151',	
'600960',	
'000727',	
'000413',	
'002843',	
'002122',	
'002385',	
'002041',	
'601028',	
'603958',	
'000998',	
'603595',	
'001319',	
'600839',	
'600449',	
'001298',	
'002038',	
'603168',	
'600476',	
'601698',	
'000070',	
'000700',	
'000981',	
'603239',	
'002901',	
'002675',	
'600083',	
'001331',	
'300164',	
'000554'
'603619',	
'002629',	
'603727',	
'002207',	
'603223',	
'000680',	
'002286',	
'000756',	
'603139',	
'002828',	
'605577',	
'600721',	
'002316',	
'605055',	
'000536',	
'601633',	
'000153',	
'605177',	
'300584',	
'000908',	
'002261',	
'300255',	
'300322',	
'000739',	
'603716',	
'002269',	
'002640',	
'603108',	
'605016',	
'601881',	
'605588',	
'603861',	
'603266',	
'002387',	
'002708',	
'603496',	
'605398',	
'003040',	
'000766',	
'000158',	
'002590',	
'000980',	
'600418',	
'000065',	
'002099',	
'603220',	


]




def get_zixuangu_df():
    aa = ak.stock_zh_a_spot_em()
    # aa.to_csv("./aaa.csv")
    need_col = ['代码', '名称', '涨跌幅', '量比', '5分钟涨跌', '涨速']
    df = aa[need_col]
    # df = df[(df['涨跌幅'] > 9) & (df['涨跌幅'] < 11)]
    # print(df)

    # 重命名
    # df.rename(columns={'代码': 'code', '名称': 'name', '涨跌幅': 'changepercent'}, inplace=True)
    df = df[(df['代码'].isin(list_zixuangu))]

    print(df)
    return df


def get_ruozhuanqiang_df():
    aa = ak.stock_zh_a_spot_em()
    need_col = ['代码', '名称', '涨跌幅', '量比', '5分钟涨跌', '涨速']
    df = aa[need_col]
    df = df[(df['代码'].isin(list_ruozhuanqiang))]

    print(df)
    return df


list_T = [
    '605118',	
'605108',	
'603936',	
'603909',	
'603879',	
'603595',	
'301359',	
'603200',	
'601360',	
'601336',	
'601138',	
'601012',	
'600903',	
'600887',	
'600884',	
'600778',	
'600689',	
'600581',	
'600536',	
'600468',	
'600360',	
'600280',	
'600212',	
'003015',	
'002975',	
'002897',	
'002861',	
'002542',	
'002531',	
'002528',	
'002084',	
'002049',	
'001368',	
'001338',	
'001270',	
'000821',	
'000721',	
'000705',	
'000656',	
'000652',	
'000572',	
'000422',	
'000032',	
'600048',	
'002918',	
'600801',	
'601236',	
'001227',	
'002193',	
'002142',	
'002385',	
'601888',	
'002561',	
'002145',	
'000957',	
'002594',	
'002547',	
'002186',	
'001256',	
'002487',	
'603616'

]

no_notify_list=[


]

def get_T():
    aa = ak.stock_zh_a_spot_em()
    need_col = ['代码', '名称', '涨跌幅', '量比', '涨速']
    df = aa[need_col]
    df = df[(df['代码'].isin(list_T))]
    # print(df)
    df.rename(columns={'代码': 'code','名称':'股票简称'}, inplace=True)

    return df



def get_zixuanguAsCode_df():
    aa = ak.stock_zh_a_spot_em()
    # aa.to_csv("./aaa.csv")
    need_col = ['代码', '名称', '涨跌幅', '量比', '5分钟涨跌', '涨速']
    df = aa[need_col]
    # df = df[(df['涨跌幅'] > 9) & (df['涨跌幅'] < 11)]
    # print(df)

    # 重命名
    # df.rename(columns={'代码': 'code', '名称': 'name', '涨跌幅': 'changepercent'}, inplace=True)
    df = df[(df['代码'].isin(list_zixuangu))]
    df.rename(columns={'代码': 'code', '名称': '股票简称'}, inplace=True)
    # print(df)
    return df



def get_no_notify_list():
    return no_notify_list



